<?php

return [
    'accepted' => 'Το πεδίο :attribute πρέπει να γίνει αποδεκτό.',
    'boolean' => 'Το πεδίο :attribute πρέπει να είναι αληθές ή ψευδές.',
    'confirmed' => 'Η επιβεβαίωση του πεδίου :attribute δεν ταιριάζει.',
    'date' => 'Το πεδίο :attribute δεν είναι έγκυρη ημερομηνία.',
    'email' => 'Το πεδίο :attribute πρέπει να είναι μια έγκυρη διεύθυνση email.',
    'exists' => 'Η επιλογή στο πεδίο :attribute δεν είναι έγκυρη.',
    'image' => 'Το πεδίο :attribute πρέπει να είναι εικόνα.',
    'in' => 'Η επιλογή στο πεδίο :attribute δεν είναι έγκυρη.',
    'integer' => 'Το πεδίο :attribute πρέπει να είναι ακέραιος αριθμός.',
    'max' => [
        'numeric' => 'Το πεδίο :attribute δεν μπορεί να είναι μεγαλύτερο από :max.',
        'file' => 'Το αρχείο :attribute δεν μπορεί να είναι μεγαλύτερο από :max kilobytes.',
        'string' => 'Το πεδίο :attribute δεν μπορεί να ξεπερνά τους :max χαρακτήρες.',
        'array' => 'Το πεδίο :attribute δεν μπορεί να έχει περισσότερα από :max στοιχεία.',
    ],
    'mimes' => 'Το πεδίο :attribute πρέπει να είναι αρχείο τύπου: :values.',
    'min' => [
        'numeric' => 'Το πεδίο :attribute πρέπει να είναι τουλάχιστον :min.',
        'file' => 'Το αρχείο :attribute πρέπει να είναι τουλάχιστον :min kilobytes.',
        'string' => 'Το πεδίο :attribute πρέπει να έχει τουλάχιστον :min χαρακτήρες.',
        'array' => 'Το πεδίο :attribute πρέπει να έχει τουλάχιστον :min στοιχεία.',
    ],
    'numeric' => 'Το πεδίο :attribute πρέπει να είναι αριθμός.',
    'regex' => 'Η μορφή του πεδίου :attribute δεν είναι έγκυρη.',
    'required' => 'Το πεδίο :attribute είναι υποχρεωτικό.',
    'string' => 'Το πεδίο :attribute πρέπει να είναι κείμενο.',
    'unique' => 'Η τιμή του πεδίου :attribute χρησιμοποιείται ήδη.',
    'url' => 'Το πεδίο :attribute πρέπει να είναι έγκυρη διεύθυνση URL.',

    'attributes' => [
        'name' => 'όνομα',
        'email' => 'email',
        'phone' => 'τηλέφωνο',
        'subject' => 'θέμα',
        'message' => 'μήνυμα',
        'passcode' => 'κωδικός',
        'q' => 'αναζήτηση',
    ],
];
